#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-vxSNVTjFoX58utWu

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210823085950307100000002]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221800000002]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221900000003]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333228000000004]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-00ae5f3b880ec6324]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0386200f19a0ec3c9]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1933826591]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2053659487]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-38523699]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-2399265100]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-908692302]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2173523361]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=mlops-eks-PvJaEFg9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=5c1c5516d557508d4c827542576c2559c378cbb5]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202660000000c]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202460000000b]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202140000000a]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331963400000009]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331955700000008]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210824015005295700000002]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-120210824015005267600000001]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.aws_eks_cluster.this[0] has been changed
  ~ resource "aws_eks_cluster" "this" {
      + enabled_cluster_log_types = []
        id                        = "mlops-eks-PvJaEFg9"
        name                      = "mlops-eks-PvJaEFg9"
        tags                      = {
            "Environment" = "test"
        }
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.eks.aws_launch_configuration.workers[0] has been changed
  ~ resource "aws_launch_configuration" "workers" {
        id                               = "mlops-eks-PvJaEFg9-worker-group-120210824015005267600000001"
        name                             = "mlops-eks-PvJaEFg9-worker-group-120210824015005267600000001"
      + vpc_classic_link_security_groups = []
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.eks.aws_launch_configuration.workers[1] has been changed
  ~ resource "aws_launch_configuration" "workers" {
        id                               = "mlops-eks-PvJaEFg9-worker-group-220210824015005295700000002"
        name                             = "mlops-eks-PvJaEFg9-worker-group-220210824015005295700000002"
      + vpc_classic_link_security_groups = []
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.eks.local_file.kubeconfig[0] has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://FB9C6A73CC67BFA26865D94FAA4E0947.yl4.ap-southeast-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF4TkRZd01sb1hEVE14TURneU1qQXhORFl3TWxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTm5PCkpIdWZRVGdaM3NmNHR5K1JINno1RW5TTXVZZVFaVzFuREx1WEpxanZ4MGpwc0FyMStQclNGcnBEYThMZFAwYVcKRXd3MVR2dTNYQmc0N08rMS85T2ZEYjJOS0NHaytBSlcxWnRVdGwyVC9KdENtaW9icmV6dEdJVE5rWnIyL0dOQgppN0tack9rVFZxZVhQOGU3UVc1bFhNV2UxaVFnZ1pwK0xybHpNRldxVFBvUWxzMU5VbTRpQTEzM1VoZFAxUUo0ClBKL3lmNWN2SlRaUnVNd3k0K2s4TFdXRmhpcVRpS0ZxT2pMeHo2ZDhWRzlqQnFNaUJNTXhaUEVmVWhXeGxRMmYKL3lSRnNTZEhDQmdoU3FXRHZqTzlZb1ZCWlprKzFkeHVsTS94NTZOdmtidE1tWWZWcEhVaEtjQUNDMW1KcVEwWApKcHJTcDdsWlFpQTVmdE4yTW9jQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLRDJFNzF1d2VOOXhKeEJCbWlxWFl2Q2FXZ1JNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBMXhmRTA4TkYva3JlMmRoY0Z2ZEFiTkZ6OFdpb01SZlRtcDUrcWU5aXJBa3A3MFJLNgpDWEc3Wlk1K1JxaXNBN0hHM1p3MTBQbkpEd3RyWDZrOGtHN25GcDFVRnl3T3FCWUVwczF6NElFRjk2a005akFWCmNWUGdiY0FFK0RBV1dGVnBIaG42Tm9qWkVxYzZjL1BFbGxHYm1yaDFJZUFDU25ROG5rVi9Pc3BkdXBwT0tTM2MKQ1dpMEhYekpheHk0ZUsvUFgrUDNuUXRsYWZPSTFyM0NUY2xkak9oMWlOdTgvd2d0VG12MWxGc0RNaW9TVmtTLwpPcysvd05VNVA1czVWNlFlMzVQa282ZE8zOGFXU29xcG1Sck1aaWVwZUlMRjJnSVorMU9VQmwvcEdSdUYxQ1JkCmZORUlsWFl6WFR0NDFVTlJzbkZDSWl0YlgxOUdpUExTVWNnTgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_mlops-eks-PvJaEFg9
            
            contexts:
            - context:
                cluster: eks_mlops-eks-PvJaEFg9
                user: eks_mlops-eks-PvJaEFg9
              name: eks_mlops-eks-PvJaEFg9
            
            current-context: eks_mlops-eks-PvJaEFg9
            
            users:
            - name: eks_mlops-eks-PvJaEFg9
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "mlops-eks-PvJaEFg9"
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0600" -> null
      - filename             = "./kubeconfig_mlops-eks-PvJaEFg9" -> null
      - id                   = "5c1c5516d557508d4c827542576c2559c378cbb5" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF4TkRZd01sb1hEVE14TURneU1qQXhORFl3TWxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTm5PCkpIdWZRVGdaM3NmNHR5K1JINno1RW5TTXVZZVFaVzFuREx1WEpxanZ4MGpwc0FyMStQclNGcnBEYThMZFAwYVcKRXd3MVR2dTNYQmc0N08rMS85T2ZEYjJOS0NHaytBSlcxWnRVdGwyVC9KdENtaW9icmV6dEdJVE5rWnIyL0dOQgppN0tack9rVFZxZVhQOGU3UVc1bFhNV2UxaVFnZ1pwK0xybHpNRldxVFBvUWxzMU5VbTRpQTEzM1VoZFAxUUo0ClBKL3lmNWN2SlRaUnVNd3k0K2s4TFdXRmhpcVRpS0ZxT2pMeHo2ZDhWRzlqQnFNaUJNTXhaUEVmVWhXeGxRMmYKL3lSRnNTZEhDQmdoU3FXRHZqTzlZb1ZCWlprKzFkeHVsTS94NTZOdmtidE1tWWZWcEhVaEtjQUNDMW1KcVEwWApKcHJTcDdsWlFpQTVmdE4yTW9jQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLRDJFNzF1d2VOOXhKeEJCbWlxWFl2Q2FXZ1JNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBMXhmRTA4TkYva3JlMmRoY0Z2ZEFiTkZ6OFdpb01SZlRtcDUrcWU5aXJBa3A3MFJLNgpDWEc3Wlk1K1JxaXNBN0hHM1p3MTBQbkpEd3RyWDZrOGtHN25GcDFVRnl3T3FCWUVwczF6NElFRjk2a005akFWCmNWUGdiY0FFK0RBV1dGVnBIaG42Tm9qWkVxYzZjL1BFbGxHYm1yaDFJZUFDU25ROG5rVi9Pc3BkdXBwT0tTM2MKQ1dpMEhYekpheHk0ZUsvUFgrUDNuUXRsYWZPSTFyM0NUY2xkak9oMWlOdTgvd2d0VG12MWxGc0RNaW9TVmtTLwpPcysvd05VNVA1czVWNlFlMzVQa282ZE8zOGFXU29xcG1Sck1aaWVwZUlMRjJnSVorMU9VQmwvcEdSdUYxQ1JkCmZORUlsWFl6WFR0NDFVTlJzbkZDSWl0YlgxOUdpUExTVWNnTgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-24 01:40:28.443 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [] -> (known after apply)
      ~ endpoint                  = "https://FB9C6A73CC67BFA26865D94FAA4E0947.yl4.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/FB9C6A73CC67BFA26865D94FAA4E0947"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
      ~ name                      = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "Environment" = "test"
        } -> (known after apply)
      ~ version                   = "1.20" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "sg-0be7b185fa5326c19"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-0386200f19a0ec3c9",
                ]
              - subnet_ids                = [
                  - "subnet-02b7b75b8875b6f02",
                  - "subnet-06dff361d9daa34ea",
                  - "subnet-0a134ea213c4bf0e2",
                ]
              - vpc_id                    = "vpc-075b2168a8a54d959"
            },
        ] -> (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      ~ id    = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ name  = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ token = (sensitive value)
    }

  # module.eks.aws_autoscaling_group.workers[0] must be replaced
+/- resource "aws_autoscaling_group" "workers" {
      ~ arn                       = "arn:aws:autoscaling:ap-southeast-2:112227029085:autoScalingGroup:f108a382-6703-42e3-bb24-a30b750c5b5e:autoScalingGroupName/mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f" -> (known after apply)
      ~ availability_zones        = [
          - "ap-southeast-2a",
          - "ap-southeast-2b",
          - "ap-southeast-2c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
      ~ desired_capacity          = 2 -> 1
      - enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f" -> (known after apply)
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-120210824015005267600000001" -> (known after apply)
      - load_balancers            = [] -> null
      ~ name                      = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f" -> (known after apply)
      ~ name_prefix               = "mlops-eks-PvJaEFg9-worker-group-1" -> "mlops-eks-worker-group-1" # forces replacement
      ~ service_linked_role_arn   = "arn:aws:iam::112227029085:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - target_group_arns         = [] -> null
        # (13 unchanged attributes hidden)

      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "mlops-eks-PvJaEFg9-worker-group-1-eks_asg" -> null
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "mlops-eks-worker-group-1-eks_asg"
        }
      + tag {
          + key                 = "k8s.io/cluster/mlops-eks"
          + propagate_at_launch = true
          + value               = "owned"
        }
      - tag {
          - key                 = "k8s.io/cluster/mlops-eks-PvJaEFg9" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
      + tag {
          + key                 = "kubernetes.io/cluster/mlops-eks"
          + propagate_at_launch = true
          + value               = "owned"
        }
      - tag {
          - key                 = "kubernetes.io/cluster/mlops-eks-PvJaEFg9" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] must be replaced
+/- resource "aws_autoscaling_group" "workers" {
      ~ arn                       = "arn:aws:autoscaling:ap-southeast-2:112227029085:autoScalingGroup:10bc03a8-85c3-4bcb-a2ef-18020ef3d77e:autoScalingGroupName/mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010" -> (known after apply)
      ~ availability_zones        = [
          - "ap-southeast-2a",
          - "ap-southeast-2b",
          - "ap-southeast-2c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
      - enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010" -> (known after apply)
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-220210824015005295700000002" -> (known after apply)
      - load_balancers            = [] -> null
      ~ name                      = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010" -> (known after apply)
      ~ name_prefix               = "mlops-eks-PvJaEFg9-worker-group-2" -> "mlops-eks-worker-group-2" # forces replacement
      ~ service_linked_role_arn   = "arn:aws:iam::112227029085:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - target_group_arns         = [] -> null
        # (14 unchanged attributes hidden)

      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "mlops-eks-PvJaEFg9-worker-group-2-eks_asg" -> null
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "mlops-eks-worker-group-2-eks_asg"
        }
      + tag {
          + key                 = "k8s.io/cluster/mlops-eks"
          + propagate_at_launch = true
          + value               = "owned"
        }
      - tag {
          - key                 = "k8s.io/cluster/mlops-eks-PvJaEFg9" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
      + tag {
          + key                 = "kubernetes.io/cluster/mlops-eks"
          + propagate_at_launch = true
          + value               = "owned"
        }
      - tag {
          - key                 = "kubernetes.io/cluster/mlops-eks-PvJaEFg9" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF4TkRZd01sb1hEVE14TURneU1qQXhORFl3TWxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTm5PCkpIdWZRVGdaM3NmNHR5K1JINno1RW5TTXVZZVFaVzFuREx1WEpxanZ4MGpwc0FyMStQclNGcnBEYThMZFAwYVcKRXd3MVR2dTNYQmc0N08rMS85T2ZEYjJOS0NHaytBSlcxWnRVdGwyVC9KdENtaW9icmV6dEdJVE5rWnIyL0dOQgppN0tack9rVFZxZVhQOGU3UVc1bFhNV2UxaVFnZ1pwK0xybHpNRldxVFBvUWxzMU5VbTRpQTEzM1VoZFAxUUo0ClBKL3lmNWN2SlRaUnVNd3k0K2s4TFdXRmhpcVRpS0ZxT2pMeHo2ZDhWRzlqQnFNaUJNTXhaUEVmVWhXeGxRMmYKL3lSRnNTZEhDQmdoU3FXRHZqTzlZb1ZCWlprKzFkeHVsTS94NTZOdmtidE1tWWZWcEhVaEtjQUNDMW1KcVEwWApKcHJTcDdsWlFpQTVmdE4yTW9jQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLRDJFNzF1d2VOOXhKeEJCbWlxWFl2Q2FXZ1JNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBMXhmRTA4TkYva3JlMmRoY0Z2ZEFiTkZ6OFdpb01SZlRtcDUrcWU5aXJBa3A3MFJLNgpDWEc3Wlk1K1JxaXNBN0hHM1p3MTBQbkpEd3RyWDZrOGtHN25GcDFVRnl3T3FCWUVwczF6NElFRjk2a005akFWCmNWUGdiY0FFK0RBV1dGVnBIaG42Tm9qWkVxYzZjL1BFbGxHYm1yaDFJZUFDU25ROG5rVi9Pc3BkdXBwT0tTM2MKQ1dpMEhYekpheHk0ZUsvUFgrUDNuUXRsYWZPSTFyM0NUY2xkak9oMWlOdTgvd2d0VG12MWxGc0RNaW9TVmtTLwpPcysvd05VNVA1czVWNlFlMzVQa282ZE8zOGFXU29xcG1Sck1aaWVwZUlMRjJnSVorMU9VQmwvcEdSdUYxQ1JkCmZORUlsWFl6WFR0NDFVTlJzbkZDSWl0YlgxOUdpUExTVWNnTgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-24 01:40:28.443 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://FB9C6A73CC67BFA26865D94FAA4E0947.yl4.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/FB9C6A73CC67BFA26865D94FAA4E0947"
                    },
                ]
            },
        ] -> (known after apply)
      ~ name                      = "mlops-eks-PvJaEFg9" -> "mlops-eks" # forces replacement
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply) # forces replacement
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "Environment" = "test"
        }
        # (2 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
        }


      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0be7b185fa5326c19" -> (known after apply)
          ~ security_group_ids        = [
              - "sg-0386200f19a0ec3c9",
            ] -> (known after apply) # forces replacement
          ~ vpc_id                    = "vpc-075b2168a8a54d959" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_iam_instance_profile.workers[0] must be replaced
+/- resource "aws_iam_instance_profile" "workers" {
      ~ arn         = "arn:aws:iam::112227029085:instance-profile/mlops-eks-PvJaEFg920210822084331963400000009" -> (known after apply)
      ~ create_date = "2021-08-22T08:43:32Z" -> (known after apply)
      ~ id          = "mlops-eks-PvJaEFg920210822084331963400000009" -> (known after apply)
      ~ name        = "mlops-eks-PvJaEFg920210822084331963400000009" -> (known after apply)
      ~ name_prefix = "mlops-eks-PvJaEFg9" -> "mlops-eks" # forces replacement
      ~ role        = "mlops-eks-PvJaEFg920210822084331718600000007" -> (known after apply)
        tags        = {
            "Environment" = "test"
        }
      ~ unique_id   = "AIPARUIKASBO7HPTP3BWZ" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_iam_instance_profile.workers[1] must be replaced
+/- resource "aws_iam_instance_profile" "workers" {
      ~ arn         = "arn:aws:iam::112227029085:instance-profile/mlops-eks-PvJaEFg920210822084331955700000008" -> (known after apply)
      ~ create_date = "2021-08-22T08:43:32Z" -> (known after apply)
      ~ id          = "mlops-eks-PvJaEFg920210822084331955700000008" -> (known after apply)
      ~ name        = "mlops-eks-PvJaEFg920210822084331955700000008" -> (known after apply)
      ~ name_prefix = "mlops-eks-PvJaEFg9" -> "mlops-eks" # forces replacement
      ~ role        = "mlops-eks-PvJaEFg920210822084331718600000007" -> (known after apply)
        tags        = {
            "Environment" = "test"
        }
      ~ unique_id   = "AIPARUIKASBORN6WY6B5C" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] must be replaced
-/+ resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      ~ arn         = "arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001" -> (known after apply)
      ~ id          = "arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001" -> (known after apply)
      ~ name        = "mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001" -> (known after apply)
      ~ name_prefix = "mlops-eks-PvJaEFg9-elb-sl-role-creation" -> "mlops-eks-elb-sl-role-creation" # forces replacement
      ~ policy_id   = "ANPARUIKASBOQFACQBPTE" -> (known after apply)
        tags        = {
            "Environment" = "test"
        }
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.cluster[0] must be replaced
+/- resource "aws_iam_role" "cluster" {
      ~ arn                   = "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks.amazonaws.com"
                        }
                        Sid       = "EKSClusterAssumeRole"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-08-22T08:33:32Z" -> (known after apply)
      ~ id                    = "mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001",
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSServicePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
      ~ name                  = "mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply)
      ~ name_prefix           = "mlops-eks-PvJaEFg9" -> "mlops-eks" # forces replacement
        tags                  = {
            "Environment" = "test"
        }
      ~ unique_id             = "AROARUIKASBO4W65PQF77" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.workers[0] must be replaced
+/- resource "aws_iam_role" "workers" {
      ~ arn                   = "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822084331718600000007" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ec2.amazonaws.com"
                        }
                        Sid       = "EKSWorkerAssumeRole"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-08-22T08:43:31Z" -> (known after apply)
      ~ id                    = "mlops-eks-PvJaEFg920210822084331718600000007" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> (known after apply)
      ~ name                  = "mlops-eks-PvJaEFg920210822084331718600000007" -> (known after apply)
      ~ name_prefix           = "mlops-eks-PvJaEFg9" -> "mlops-eks" # forces replacement
        tags                  = {
            "Environment" = "test"
        }
      ~ unique_id             = "AROARUIKASBO3A26W467E" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      ~ id         = "mlops-eks-PvJaEFg920210822083332937800000001-20210822083333228000000004" -> (known after apply)
      ~ role       = "mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      ~ id         = "mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221900000003" -> (known after apply)
      ~ role       = "mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      ~ id         = "mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221800000002" -> (known after apply)
      ~ role       = "mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      ~ id         = "mlops-eks-PvJaEFg920210822083332937800000001-20210823085950307100000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001" -> (known after apply) # forces replacement
      ~ role       = "mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply) # forces replacement
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      ~ id         = "mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202460000000b" -> (known after apply)
      ~ role       = "mlops-eks-PvJaEFg920210822084331718600000007" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      ~ id         = "mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202140000000a" -> (known after apply)
      ~ role       = "mlops-eks-PvJaEFg920210822084331718600000007" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      ~ id         = "mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202660000000c" -> (known after apply)
      ~ role       = "mlops-eks-PvJaEFg920210822084331718600000007" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:c98bb6fd-731e-43cd-b9ce-dd6308b954e3:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-120210824015005267600000001" -> (known after apply)
      ~ iam_instance_profile             = "mlops-eks-PvJaEFg920210822084331963400000009" -> (known after apply) # forces replacement
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-120210824015005267600000001" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-120210824015005267600000001" -> (known after apply)
      ~ name_prefix                      = "mlops-eks-PvJaEFg9-worker-group-1" -> "mlops-eks-worker-group-1" # forces replacement
      ~ security_groups                  = [
          - "sg-00a9df337c017e67f",
          - "sg-00ae5f3b880ec6324",
        ] -> (known after apply) # forces replacement
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsT1JFRjRUa1JaZDAxc2IxaEVWRTE0VFVSbmVVMXFRWGhPUkZsM1RXeHZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVG01UENrcElkV1pSVkdkYU0zTm1OSFI1SzFKSU5ubzFSVzVUVFhWWlpWRmFWekZ1UkV4MVdFcHhhblo0TUdwd2MwRnlNU3RRY2xOR2NuQkVZVGhNWkZBd1lWY0tSWGQzTVZSMmRUTllRbWMwTjA4ck1TODVUMlpFWWpKT1MwTkhheXRCU2xjeFduUlZkR3d5VkM5S2RFTnRhVzlpY21WNmRFZEpWRTVyV25JeUwwZE9RZ3BwTjB0YWNrOXJWRlp4WlZoUU9HVTNVVmMxYkZoTlYyVXhhVkZuWjFwd0sweHliSHBOUmxkeFZGQnZVV3h6TVU1VmJUUnBRVEV6TTFWb1pGQXhVVW8wQ2xCS0wzbG1OV04yU2xSYVVuVk5kM2swSzJzNFRGZFhSbWhwY1ZScFMwWnhUMnBNZUhvMlpEaFdSemxxUW5GTmFVSk5UWGhhVUVWbVZXaFhlR3hSTW1ZS0wzbFNSbk5UWkVoRFFtZG9VM0ZYUkhacVR6bFpiMVpDV2xwckt6RmtlSFZzVFM5NE5UWk9kbXRpZEUxdFdXWldjRWhWYUV0alFVTkRNVzFLY1ZFd1dBcEtjSEpUY0Rkc1dsRnBRVFZtZEU0eVRXOWpRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkxSREpGTnpGMWQyVk9PWGhLZUVKQ2JXbHhXRmwyUTJGWFoxSk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkJNWGhtUlRBNFRrWXZhM0psTW1Sb1kwWjJaRUZpVGtaNk9GZHBiMDFTWmxSdGNEVXJjV1U1YVhKQmEzQTNNRkpMTmdwRFdFYzNXbGsxSzFKeGFYTkJOMGhITTFwM01UQlFia3BFZDNSeVdEWnJPR3RITjI1R2NERlZSbmwzVDNGQ1dVVndjekY2TkVsRlJqazJhMDA1YWtGV0NtTldVR2RpWTBGRkswUkJWMWRHVm5CSWFHNDJUbTlxV2tWeFl6WmpMMUJGYkd4SFltMXlhREZKWlVGRFUyNVJPRzVyVmk5UGMzQmtkWEJ3VDB0VE0yTUtRMWRwTUVoWWVrcGhlSGswWlVzdlVGZ3JVRE51VVhSc1lXWlBTVEZ5TTBOVVkyeGthazlvTVdsT2RUZ3ZkMmQwVkcxMk1XeEdjMFJOYVc5VFZtdFRMd3BQY3lzdmQwNVZOVkExY3pWV05sRmxNelZRYTI4MlpFOHpPR0ZYVTI5eGNHMVNjazFhYVdWd1pVbE1SakpuU1Zvck1VOVZRbXd2Y0VkU2RVWXhRMUprQ21aT1JVbHNXRmw2V0ZSME5ERlZUbEp6YmtaRFNXbDBZbGd4T1VkcFVFeFRWV05uVGdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vRkI5QzZBNzNDQzY3QkZBMjY4NjVEOTRGQUE0RTA5NDcueWw0LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:89c128f5-038a-4050-a146-d1d0bb2f930e:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-220210824015005295700000002" -> (known after apply)
      ~ iam_instance_profile             = "mlops-eks-PvJaEFg920210822084331955700000008" -> (known after apply) # forces replacement
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-220210824015005295700000002" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-220210824015005295700000002" -> (known after apply)
      ~ name_prefix                      = "mlops-eks-PvJaEFg9-worker-group-2" -> "mlops-eks-worker-group-2" # forces replacement
      ~ security_groups                  = [
          - "sg-00ae5f3b880ec6324",
          - "sg-081c66a871fd32313",
        ] -> (known after apply) # forces replacement
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsT1JFRjRUa1JaZDAxc2IxaEVWRTE0VFVSbmVVMXFRWGhPUkZsM1RXeHZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVG01UENrcElkV1pSVkdkYU0zTm1OSFI1SzFKSU5ubzFSVzVUVFhWWlpWRmFWekZ1UkV4MVdFcHhhblo0TUdwd2MwRnlNU3RRY2xOR2NuQkVZVGhNWkZBd1lWY0tSWGQzTVZSMmRUTllRbWMwTjA4ck1TODVUMlpFWWpKT1MwTkhheXRCU2xjeFduUlZkR3d5VkM5S2RFTnRhVzlpY21WNmRFZEpWRTVyV25JeUwwZE9RZ3BwTjB0YWNrOXJWRlp4WlZoUU9HVTNVVmMxYkZoTlYyVXhhVkZuWjFwd0sweHliSHBOUmxkeFZGQnZVV3h6TVU1VmJUUnBRVEV6TTFWb1pGQXhVVW8wQ2xCS0wzbG1OV04yU2xSYVVuVk5kM2swSzJzNFRGZFhSbWhwY1ZScFMwWnhUMnBNZUhvMlpEaFdSemxxUW5GTmFVSk5UWGhhVUVWbVZXaFhlR3hSTW1ZS0wzbFNSbk5UWkVoRFFtZG9VM0ZYUkhacVR6bFpiMVpDV2xwckt6RmtlSFZzVFM5NE5UWk9kbXRpZEUxdFdXWldjRWhWYUV0alFVTkRNVzFLY1ZFd1dBcEtjSEpUY0Rkc1dsRnBRVFZtZEU0eVRXOWpRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkxSREpGTnpGMWQyVk9PWGhLZUVKQ2JXbHhXRmwyUTJGWFoxSk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkJNWGhtUlRBNFRrWXZhM0psTW1Sb1kwWjJaRUZpVGtaNk9GZHBiMDFTWmxSdGNEVXJjV1U1YVhKQmEzQTNNRkpMTmdwRFdFYzNXbGsxSzFKeGFYTkJOMGhITTFwM01UQlFia3BFZDNSeVdEWnJPR3RITjI1R2NERlZSbmwzVDNGQ1dVVndjekY2TkVsRlJqazJhMDA1YWtGV0NtTldVR2RpWTBGRkswUkJWMWRHVm5CSWFHNDJUbTlxV2tWeFl6WmpMMUJGYkd4SFltMXlhREZKWlVGRFUyNVJPRzVyVmk5UGMzQmtkWEJ3VDB0VE0yTUtRMWRwTUVoWWVrcGhlSGswWlVzdlVGZ3JVRE51VVhSc1lXWlBTVEZ5TTBOVVkyeGthazlvTVdsT2RUZ3ZkMmQwVkcxMk1XeEdjMFJOYVc5VFZtdFRMd3BQY3lzdmQwNVZOVkExY3pWV05sRmxNelZRYTI4MlpFOHpPR0ZYVTI5eGNHMVNjazFhYVdWd1pVbE1SakpuU1Zvck1VOVZRbXd2Y0VkU2RVWXhRMUprQ21aT1JVbHNXRmw2V0ZSME5ERlZUbEp6YmtaRFNXbDBZbGd4T1VkcFVFeFRWV05uVGdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vRkI5QzZBNzNDQzY3QkZBMjY4NjVEOTRGQUE0RTA5NDcueWw0LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_security_group.cluster[0] must be replaced
+/- resource "aws_security_group" "cluster" {
      ~ arn                    = "arn:aws:ec2:ap-southeast-2:112227029085:security-group/sg-0386200f19a0ec3c9" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow cluster egress access to the Internet."
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0386200f19a0ec3c9" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow pods to communicate with the EKS cluster API."
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-00ae5f3b880ec6324",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "mlops-eks-PvJaEFg920210822083342191500000006" -> (known after apply)
      ~ name_prefix            = "mlops-eks-PvJaEFg9" -> "mlops-eks" # forces replacement
      ~ owner_id               = "112227029085" -> (known after apply)
      ~ tags                   = {
          ~ "Name"        = "mlops-eks-PvJaEFg9-eks_cluster_sg" -> "mlops-eks-eks_cluster_sg"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          ~ "Name"        = "mlops-eks-PvJaEFg9-eks_cluster_sg" -> "mlops-eks-eks_cluster_sg"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.workers[0] must be replaced
+/- resource "aws_security_group" "workers" {
      ~ arn                    = "arn:aws:ec2:ap-southeast-2:112227029085:security-group/sg-00ae5f3b880ec6324" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow nodes all egress to the Internet."
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-00ae5f3b880ec6324" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow node to communicate with each other."
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0386200f19a0ec3c9",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow workers pods to receive communication from the cluster control plane."
              - from_port        = 1025
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0386200f19a0ec3c9",
                ]
              - self             = false
              - to_port          = 65535
            },
        ] -> (known after apply)
      ~ name                   = "mlops-eks-PvJaEFg920210822083342163300000005" -> (known after apply)
      ~ name_prefix            = "mlops-eks-PvJaEFg9" -> "mlops-eks" # forces replacement
      ~ owner_id               = "112227029085" -> (known after apply)
      ~ tags                   = {
          ~ "Name"                                     = "mlops-eks-PvJaEFg9-eks_worker_sg" -> "mlops-eks-eks_worker_sg"
          + "kubernetes.io/cluster/mlops-eks"          = "owned"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "owned" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          ~ "Name"                                     = "mlops-eks-PvJaEFg9-eks_worker_sg" -> "mlops-eks-eks_worker_sg"
          + "kubernetes.io/cluster/mlops-eks"          = "owned"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "owned" -> null
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster_egress_internet[0] must be replaced
+/- resource "aws_security_group_rule" "cluster_egress_internet" {
      ~ id                       = "sgrule-1933826591" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0386200f19a0ec3c9" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] must be replaced
+/- resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-2053659487" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0386200f19a0ec3c9" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-00ae5f3b880ec6324" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.workers_egress_internet[0] must be replaced
+/- resource "aws_security_group_rule" "workers_egress_internet" {
      ~ id                       = "sgrule-2173523361" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-00ae5f3b880ec6324" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster[0] must be replaced
+/- resource "aws_security_group_rule" "workers_ingress_cluster" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-2399265100" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-00ae5f3b880ec6324" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-0386200f19a0ec3c9" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] must be replaced
+/- resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-38523699" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-00ae5f3b880ec6324" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-0386200f19a0ec3c9" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.workers_ingress_self[0] must be replaced
+/- resource "aws_security_group_rule" "workers_ingress_self" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-908692302" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-00ae5f3b880ec6324" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-00ae5f3b880ec6324" -> (known after apply) # forces replacement
      ~ to_port                  = 0 -> 65535
        # (5 unchanged attributes hidden)
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_mlops-eks"
      + id                   = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0b18743b4b7302c8f"
      ~ tags                 = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0374fd609632adf7d"
      ~ tags     = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-05b5a62b36b141900"
      ~ tags                 = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-06028b53eb644fe96"
      ~ tags             = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-02d825833703ae3e8"
      ~ tags             = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-02b7b75b8875b6f02"
      ~ tags                            = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                        = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-06dff361d9daa34ea"
      ~ tags                            = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                        = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0a134ea213c4bf0e2"
      ~ tags                            = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                        = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0aff3cd4393d112eb"
      ~ tags                            = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                        = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-073345847327cab44"
      ~ tags                            = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                        = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-00dd6ad17f28e0110"
      ~ tags                            = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                        = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-075b2168a8a54d959"
      ~ tags                             = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all                         = {
          + "kubernetes.io/cluster/mlops-eks"          = "shared"
          - "kubernetes.io/cluster/mlops-eks-PvJaEFg9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }

Plan: 26 to add, 12 to change, 25 to destroy.

Changes to Outputs:
  ~ cluster_endpoint          = "https://FB9C6A73CC67BFA26865D94FAA4E0947.yl4.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
  ~ cluster_id                = "mlops-eks-PvJaEFg9" -> (known after apply)
  ~ cluster_name              = "mlops-eks-PvJaEFg9" -> "mlops-eks"
  ~ cluster_security_group_id = "sg-0386200f19a0ec3c9" -> (known after apply)
  ~ kubectl_config            = <<-EOT
        apiVersion: v1
        preferences: {}
        kind: Config
        
        clusters:
        - cluster:
            server: https://FB9C6A73CC67BFA26865D94FAA4E0947.yl4.ap-southeast-2.eks.amazonaws.com
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF4TkRZd01sb1hEVE14TURneU1qQXhORFl3TWxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTm5PCkpIdWZRVGdaM3NmNHR5K1JINno1RW5TTXVZZVFaVzFuREx1WEpxanZ4MGpwc0FyMStQclNGcnBEYThMZFAwYVcKRXd3MVR2dTNYQmc0N08rMS85T2ZEYjJOS0NHaytBSlcxWnRVdGwyVC9KdENtaW9icmV6dEdJVE5rWnIyL0dOQgppN0tack9rVFZxZVhQOGU3UVc1bFhNV2UxaVFnZ1pwK0xybHpNRldxVFBvUWxzMU5VbTRpQTEzM1VoZFAxUUo0ClBKL3lmNWN2SlRaUnVNd3k0K2s4TFdXRmhpcVRpS0ZxT2pMeHo2ZDhWRzlqQnFNaUJNTXhaUEVmVWhXeGxRMmYKL3lSRnNTZEhDQmdoU3FXRHZqTzlZb1ZCWlprKzFkeHVsTS94NTZOdmtidE1tWWZWcEhVaEtjQUNDMW1KcVEwWApKcHJTcDdsWlFpQTVmdE4yTW9jQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLRDJFNzF1d2VOOXhKeEJCbWlxWFl2Q2FXZ1JNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBMXhmRTA4TkYva3JlMmRoY0Z2ZEFiTkZ6OFdpb01SZlRtcDUrcWU5aXJBa3A3MFJLNgpDWEc3Wlk1K1JxaXNBN0hHM1p3MTBQbkpEd3RyWDZrOGtHN25GcDFVRnl3T3FCWUVwczF6NElFRjk2a005akFWCmNWUGdiY0FFK0RBV1dGVnBIaG42Tm9qWkVxYzZjL1BFbGxHYm1yaDFJZUFDU25ROG5rVi9Pc3BkdXBwT0tTM2MKQ1dpMEhYekpheHk0ZUsvUFgrUDNuUXRsYWZPSTFyM0NUY2xkak9oMWlOdTgvd2d0VG12MWxGc0RNaW9TVmtTLwpPcysvd05VNVA1czVWNlFlMzVQa282ZE8zOGFXU29xcG1Sck1aaWVwZUlMRjJnSVorMU9VQmwvcEdSdUYxQ1JkCmZORUlsWFl6WFR0NDFVTlJzbkZDSWl0YlgxOUdpUExTVWNnTgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
          name: eks_mlops-eks-PvJaEFg9
        
        contexts:
        - context:
            cluster: eks_mlops-eks-PvJaEFg9
            user: eks_mlops-eks-PvJaEFg9
          name: eks_mlops-eks-PvJaEFg9
        
        current-context: eks_mlops-eks-PvJaEFg9
        
        users:
        - name: eks_mlops-eks-PvJaEFg9
          user:
            exec:
              apiVersion: client.authentication.k8s.io/v1alpha1
              command: aws-iam-authenticator
              args:
                - "token"
                - "-i"
                - "mlops-eks-PvJaEFg9"
    EOT -> (known after apply)

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*